Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/i18n-omegat.tmx
Source language: en_us
Languages: pt_br

source: Ar&guments:
pt_br: Ar&gumentos:

source: &Init Code Format:
pt_br: Formato &inicial do código:

source: &Non-Internationalization Regular Expression Format:
pt_br: Formato de expressão regular &não-internacionalizado:

source: &Internationalization Regular Expression Format:
pt_br: Formato de expressão regular para &internacionalização :

source: Inte&rnationalize...
pt_br: Inte&rnacionalizar...

source: &Internationalization
pt_br: &Internacionalização

source: Internationalize
pt_br: Internacionalizar

source: Information About Found String
pt_br: Informações sobre a string encontrada

source: The key for your property is not valid.
pt_br: A chave para sua propriedade não é válida.

source: Please choose another key.
pt_br: Favor escolher outra chave.

source: No hard-coded, non-internationalized strings were found in this file.
pt_br: Nenhum literal string não-internacionalizado foi encontrado neste arquivo.

source: The document could not be opened.
pt_br: O documento não pôde ser aberto.

source: Cannot internationalize.
pt_br: Não foi possível internacionalizar.

source: Internationalization
pt_br: Internacionalização

source: Generate Field
pt_br: Gerar campo

source: Generates field initialized with bundle for java sources.
pt_br: Gera campos internacionalizados com pacote para código-fonte Java.

source: Advanced Wizard
pt_br: Assistente avançado

source: If True, displays an additional pane in wizard for generating fields that reference resource bundles.
pt_br: Se 'verdadeiro', exibe um painel adicional no assistente, para geração de campos que referenciem conjunto de recursos.

source: Bundle Init Format
pt_br: Formato inicial para pacote

source: The format used to initialize resource bundle fields.
pt_br: O formato utilizado para inicializar campos de pacotes de recursos.

source: I18n Search Format
pt_br: Formato de pesquisa de internacionalização

source: Specifies which hard-coded strings need to be internationalized.
pt_br: Especifica quais literais strings necessitam ser internacionalizados.

source: I18n Test Wizard Format
pt_br: Formato do assistente de teste de internacionalização

source: Specifies which strings the Internationalization Test wizard checks for keys.
pt_br: Especifica quais literais string o assistente de Testes de Internacionalização verifica procurando chaves.

source: Overwrite Resource Value
pt_br: Sobrescrever valor do recurso

source: Overrides the values of any existing keys in the resource bundle.
pt_br: Sobrescreve os valores de quaisquer chaves existentes nos pacotes de recursos.

source: I18n String Format
pt_br: Formato de string de internacionalização

source: Default code format for constructing internationalized strings.
pt_br: Formato de código padrão para construção de strings internacionalizadas.

source: Cancel
pt_br: Cancelar

source: &Help
pt_br: Aj&uda

source: R&eplace
pt_br: Subst&ituir

source: &Skip
pt_br: &Ignorar

source: Replace:
pt_br: Substituir:

source: This panel allows you to choose or create a bundle, set the replace string format, and set property keys and values.
pt_br: Este painel permite você escolher ou criar um pacote, definir o formato do string de substituição e definir as chaves e valores para as propriedades.

source: &Close
pt_br: Fe&char

source: any character of [:digit:] or [:alpha:] class
pt_br: qualquer caractere da classe [:digit:] ou [:alpha:]

source: any letter.
pt_br: qualquer letra.

source: message format arguments.
pt_br: argumentos do formato da mensagem.

source: space or tab.
pt_br: espaço ou tab.

source: any character with octal codes 000 through 037, or DEL (octal code 177).
pt_br: qualquer caractere com código octal de 000 até 037, ou DEL (código octal 177).

source: any digit.
pt_br: qualquer dígito.

source: field identifier initialized with bundle.
pt_br: identificador do campo inicializado com pacote.

source: any character that is not a [:alnum:] or [:punct:] class.
pt_br: qualquer caractere que não seja uma classe [:alnum:] ou [:punct:].

source: hard-coded string to be found.
pt_br: literal string a ser localizada.

source: java part.
pt_br: parte java.

source: java start.
pt_br: início de java.

source: key from resource.
pt_br: chave do recurso.

source: any lower case letter.
pt_br: qualquer letra minúscula.

source: package name of bundle separated by dots.
pt_br: nome do pacote, separado por pontos.

source: package name of bundle separated with slashes.
pt_br: nome do pacote, separado com barras.

source: any character from the [:space:] class, and any character that is not in the [:graph:] class.
pt_br: qualquer caractere da classe [:space:], e qualquer caractere que não esteja na classe [:graph:].

source: any one of !
pt_br: qualquer um de !

source: name of target data object.
pt_br: nome do objeto de dados alvo.

source: (The name of the file that is searched for the hard-coded string.)
pt_br: (O nome do arquivo o qual é pesquisado procura do literal string)

source: any character of CR FF HT NL VT SPACE.
pt_br: qualquer caractere de CR FF HT NL VT ESPAÇO.

source: any upper case letter.
pt_br: qualquer letra maíuscula.

source: any hexa digit character.
pt_br: qualquer dígito hexadecimal.

source: Component:
pt_br: Componente:

source: Found in:
pt_br: Encontrado em:

source: Property:
pt_br: Propriedade:

source: Insert Internationalized String
pt_br: Inserir string internacionalizada

source: Insert Internationalized &String...
pt_br: Inserir &string internacionalizada

source: Cannot insert internationalized string in guarded block.
pt_br: Não é possível inserir strings internacionalizadas em blocos protegidos.

source: Tools
pt_br: Ferramentas

source: Simplifies internationalization of applications.
pt_br: Simplifica a internacionalização de aplicações.

source: The Internationalization module, combined with the Properties module, simplifies internationalization of Java applications.
pt_br: O módulo de Internacionalização, combinado com o o módulo de Propriedades simplifica as internacionalização e aplicações Java.

source: It includes a wizard, which enables you to internationalize all of your Java at once, a test tool, which reports any missing key-value pairs, and an execution service, which enables you to set the locale in which the application is to run.
pt_br: Inclui um assistente que permite internacionalizar todo o seu código Java de uma vez, uma ferramenta de testes que reporta a ausência de pares chave-valor, e um serviço de execução que permite definir o locale no qual a aplicação é executada.

source: Fo&rmat...
pt_br: Fo&rmatar...

source: &Key:
pt_br: C&have:

source: Code:
pt_br: Código:

source: Replace Code Format Editor
pt_br: Editor do formato do código de substituição

source: &Value:
pt_br: &Valor:

source: This panel allows you to set the code format of internationalized strings and set property keys and values.
pt_br: Este painel permite definir o formato do código das strings internacionalizadas e chaves e valores de propriedades.

source: Commen&t:
pt_br: Comen&tário:

source: &Replace Code Format:
pt_br: Fo&rmato do código de substituição:

source: Ar&guments...
pt_br: Ar&gumentos...

source: New...
pt_br: Novo...

source: &Select:
pt_br: &Selecionar:

source: Select Resource Bundle
pt_br: Selecionar pacote de recursos

source: New Bundle
pt_br: Novo pacote

source: &Filesystem:
pt_br: &Sistema de arquivos:

source: Bundle Name:
pt_br: Nome do pacote:

source: Choose Bundle
pt_br: Escolher pacote

source: Object &Name
pt_br: &Nome do objeto

source: This panel allows you to create new bundle or open and existing one.
pt_br: Este painel permite criar um novo pacote ou abrir um existente.

source: Sources
pt_br: Códigos-fonte

source: Create &New
pt_br: Criar &novo

source: &File Name:
pt_br: Nome do &arquivo:

source: Tree View
pt_br: Visualização em árvore

source: Tree view in file selector
pt_br: Visualização em árvore no seletor de arquivos

source: File selector dialog
pt_br: Caixa de diálogo para seleção de arquivos

source: No more hard-coded strings found.
pt_br: Nenhum literal string adicional foi encontrado.

source: Searching for hard-coded strings...
pt_br: Procurando por literais string...

source: No hard-coded strings were found in this file.
pt_br: Nenhum literal string foi encontrado neste arquivo.

source: Init Code Format:
pt_br: Formato &inicial do código:

source: <&default>
pt_br: <pa&drão>

source: &Generate Field
pt_br: &Gerar campo

source: Parameters...
pt_br: Parâmetros...

source: Fie&ld:
pt_br: Ca&mpo:

source: Id&entifier:
pt_br: Id&entificador:

source: &Init String:
pt_br: String &inicial:

source: Init Code Format Editor
pt_br: Editor do formato inicial do código

source: Modifiers:
pt_br: Modificadores:

source: Arguments...
pt_br: Argumentos...

source: Message Format Arguments
pt_br: Argumentos de formato de mensagem

source: &Add
pt_br: &Adicionar

source: &Remove
pt_br: &Remover

source: C&ode:
pt_br: Códig&o:

source: Comment:
pt_br: Comentário:

source: One of the hard-coded strings found could not be replaced.
pt_br: Um dos literais string encontrados não pôde ser substituído.

source: Found {0} hard-coded string evaluation error.
pt_br: Encontrado erro {0} de avaliação de literal string.

source: Process it anyway?
pt_br: Processar assim mesmo?

source: Template for creating a new properties file not found.
pt_br: Não foi encontrado um modelo para criação de um novo arquivo de propriedades.

source: Additional changes in
pt_br: Alterações adicionais em

source: &Source:
pt_br: &Código-fonte

source: Has No Additional Values
pt_br: Sem valores adicionais

source: Modify additional values.
pt_br: Modificar valores adicionais.

source: Modify Found Strings.
pt_br: Modificar strings encontradas.

source: Sources with hardcoded strings.
pt_br: Códigos-fonte com literais strings.

source: Hardcoded strings found in the selected source.
pt_br: Literais strings encontrados no código-fonte selecionado.

source: &Found Hard-Coded Strings:
pt_br: &Encontrados literais strings:

source: Hard-Coded String
pt_br: Strings literais

source: Internationalizing
pt_br: Internacionalizando

source: Key
pt_br: Chave

source: Value
pt_br: Valor

source: Modify Found Strings
pt_br: Modificar strings encontradas

source: No hard-coded noninternationalized strings were found.
pt_br: Nenhum literal string não-internacionalizado foi encontrado.

source: No hard-coded noninternationalized strings found for this source.
pt_br: Nenhum literal string não-internacionalizado foi encontrado neste código-fonte.

source: Customize Property
pt_br: Personalizar propriedade

source: Internationalization &Test Wizard
pt_br: Assistente de &testes de internacionalização

source: Internationalization Test Wizard
pt_br: Assistente de testes de internacionalização

source: Find Internationalized Strings With Missing Resource
pt_br: Localizar strings internacionalizadas com recursos faltantes

source: Select Sources to Test
pt_br: Selecionar códigos-fonte para teste

source: Select Resources for Sources
pt_br: Selecionar recursos para códigos-fonte

source: &Internationalization Wizard
pt_br: Assistente de &internacionalização

source: Internationalization Wizard
pt_br: Assistente de internacionalização

source: Field generation
pt_br: Geração de campo

source: Select Sources to Internationalize
pt_br: Selecionar códigos-fonte à internacionalizar

source: &Next >
pt_br: &Próximo >

source: Moves to next step of the wizard.
pt_br: Avança para o próximo passo do assistente.

source: < &Back
pt_br: < &Anterior

source: Moves to previous step of the wizard.
pt_br: Retorna para o passo anterior do assistente.

source: Finish
pt_br: Finalizar

source: Resource
pt_br: Recurso

source: Select &Resource
pt_br: Selecionar &recurso

source: Select &All
pt_br: Selecion&ar tudo

source: Source
pt_br: Código-fonte

source: Select Resource
pt_br: Selecionar recurso

source: Loading
pt_br: Carregando

source: Select the resource bundle(s) where you want to store each file's internationalized strings.
pt_br: Selecione o(s) pacote(s) de recursos onde serão armazenados os strings de internacionalização de cada arquivo.

source: Click Select All to check one resource bundle for all files.
pt_br: Clique em Selecionar todos para marcar um pacote de recursos para todos os arquivos.

source: Select the resource bundle(s) that contain each file's internationalized string keys.
pt_br: Selecione o(s) pacote(s) de recursos que contêm as chaves de internacionalização para cada arquivo.

source: &Add Source(s)
pt_br: &Adicionar código(s)-fonte

source: Add arbitrary file or folder (recursively) to be processed.
pt_br: Adiciona arbitrariamente arquivo ou pasta (recursivamente) a ser processada.

source: &Remove Source(s)
pt_br: &Remover código(s)-fonte

source: Remove selected source from processing.
pt_br: Remove o código-fonte selecionado do processamento.

source: List of Sources
pt_br: Lista de códigos-fonte

source: Select the source files that you want to internationalize.
pt_br: Selecione os arquivos código-fonte que você deseja internacionalizar.

source: Select the source files that you want to check for internationalized strings with missing keys.
pt_br: Selecione os arquivos códigos-fonte para os quais você deseja verificar a ocorrência de strings internacionalizadas com chaves faltantes.

source: Filesystems:
pt_br: Sistemas de arquivos:

source: Selected the resource bundle(s) to check for each file's internationalized strings.
pt_br: Selecione os pacotes de recursos as serem verificados à procura dos literais internacionalizados para cada arquivo.

source: Select Sources
pt_br: Selecionar códigos-fonte

source: Select Sources to Test for Missing Resources
pt_br: Selecionar os códigos-fonte à verificar recursos faltantes

source: Use the buttons to add and remove source files.
pt_br: Use os botões para adicionar e remover arquivos de códigos-fonte.

source: Internationalized String
pt_br: String internacionalizada

source: All internationalized strings have their keys.
pt_br: Todas as strings internacionalizadas têm suas respectivas chaves.

source: All internationalized strings for this source have their keys.
pt_br: Todas as strings internacionalizadas para este código-fonte têm suas respectivas chaves.

source: &Found Strings with Missing Keys:
pt_br: Localizado strings com chaves &faltantes:

source: Cannot insert strings with empty keys.
pt_br: Não é possível inserir strings com chaves vazias.

source: Please choose a nonempty key for this string.
pt_br: Por favor escolha uma chave não-vazia para esta string.

source: Found Strings with Missing Keys
pt_br: Localizado strings com chaves faltantes

source: Internationalization of Form
pt_br: Internacionalização de formulários

source: Enables internationalization of files created with the IDE's Form Editor.
pt_br: Permite a internacionalização de arquivos criados com o Editor de formulários do IDE.

source: The Internationalization of Form module enables you to internationalize visual forms that you create in the IDE's Form Editor.
pt_br: O módulo de internacionalização de formulários permite a internacionalização de formulários visuais criados no Editor de formulários do IDE.

source: Internationalized Mnemonics
pt_br: Mnemônicos internacionalizados

source: Internationalized Index
pt_br: Índice internacionalizado

source: Resource Bundle
pt_br: Pacote de recursos

source: Resource or key value is missing.
pt_br: Recurso ou valor de chave estão faltando.

source: Invalid value.
pt_br: Valor inválido.

source: [INVALID RESOURCE VALUE]
pt_br: [VALOR INVÁLIDO DE RECURSO ]

source: KEY {0} : RB {1}
pt_br: CHAVE {0} : PACOTE {1}

source: Select Properties File
pt_br: Selecionar arquivo de propriedade

source: Do &not internationalize this string
pt_br: &Não internacionalizar este string

source: No hard-coded string found in guarded block yet.
pt_br: Nenhum literal string foi encontrado ainda no bloco de código protegido.
